
## Plan Result

[CI link](https://github.com/l-1cm-l/gha_playground/actions/runs/13966495805)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * aws_s3_bucket.test_s3_bucket_202502121629
  * google_storage_bucket.test_gcs_bucket_202501052228
* Delete
  * aws_s3_bucket.example
  * google_storage_bucket.test_bucket_202501052228


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.example will be destroyed
  # (because aws_s3_bucket.example is not in configuration)
  - resource "aws_s3_bucket" "example" {
      - arn                         = "arn:aws:s3:::202502121629t" -> null
      - bucket                      = "202502121629t" -> null
      - bucket_domain_name          = "202502121629t.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "202502121629t.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "202502121629t" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "f94ae5937e7d4a045b74ecea6c32355c30133c80cd941b97f97b97cdd0a4608e" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.test_s3_bucket_202502121629 will be created
  + resource "aws_s3_bucket" "test_s3_bucket_202502121629" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "202502121629t"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.test_bucket_202501052228 will be destroyed
  # (because google_storage_bucket.test_bucket_202501052228 is not in configuration)
  - resource "google_storage_bucket" "test_bucket_202501052228" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "test-bucket-202501052228" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-NORTHEAST1" -> null
      - name                        = "test-bucket-202501052228" -> null
      - project                     = "dev-ss-444303" -> null
      - project_number              = 1049987498512 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-202501052228" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://test-bucket-202501052228" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-01-05T14:27:38.851Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

  # google_storage_bucket.test_gcs_bucket_202501052228 will be created
  + resource "google_storage_bucket" "test_gcs_bucket_202501052228" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "test-bucket-202501052228"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"aws-googlecloud-terraform-plan","PRNumber":77,"Program":"tfcmt","SHA1":"d572bae8fef843b9543099ccce9019897c08b219","Vars":{},"WorkflowName":"terraform-plan"} -->